app/Controllers/ApiController.php

SELECT *
FROM `customers`
ORDER BY `customer_code` ASC
---
    public function getAllCustomers()
    {
        // Load toàn bộ danh sách khách hàng
        $customers = $this->customerModel->orderBy('customer_code', 'ASC')->findAll();

SELECT *
FROM `product_types`
---
    public function getAllProductTypes()
    {
        try {
            // Lấy danh sách loại hàng
            $productTypes = $this->productTypeModel->findAll();

SELECT *
FROM `orders`
WHERE `tracking_code` = '7848844279'
 LIMIT 1
---
    public function checkTrackingCode()
    {
        $trackingCode = $this->request->getGet('tracking_code');
        if (empty($trackingCode)) {
            return $this->response->setStatusCode(400)->setBody('0');
        }
        $exists = $this->orderModel->where('tracking_code', $trackingCode)->first();