app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        $exchangeRateModel = new ExchangeRateModel();
        $latestRate = $exchangeRateModel->orderBy('updated_at', 'DESC')->first();
---
SELECT *
FROM `exchange_rates`
ORDER BY `updated_at` DESC
 LIMIT 1