app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `customers`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE MONTH(created_at) = '03'
AND YEAR(created_at) = '2025'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE MONTH(created_at) = '03'
AND YEAR(created_at) = '2025'
SELECT `orders`.`id`, `orders`.`tracking_code`, `customers`.`fullname` as `customer_name`, `customers`.`customer_code` as `customer_code`, `orders`.`created_at`, CASE 
            WHEN orders.invoice_id IS NULL THEN 'in_stock'  -- Đơn tồn kho (chưa có invoice)
            WHEN i.shipping_status = 'pending' THEN 'shipping'  -- Đơn đang giao
            WHEN i.shipping_status = 'confirmed' THEN 'shipped'  -- Đơn đã giao
            ELSE 'unknown'  -- Trường hợp khác
        END AS order_status
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
LEFT JOIN `invoices` `i` ON `i`.`id` = `orders`.`invoice_id`
ORDER BY `orders`.`created_at` DESC
 LIMIT 8
---
    public function index()
    {
        // Tổng quan số liệu
        $data['totalCustomers'] = $this->customerModel->countAll();
        $data['totalOrders'] = $this->orderModel->countAll();
        $data['newCustomers'] = $this->customerModel
            ->where('MONTH(created_at)', date('m'))
            ->where('YEAR(created_at)', date('Y'))
            ->countAllResults();
        $data['newOrders'] = $this->orderModel
            ->where('MONTH(created_at)', date('m'))
            ->where('YEAR(created_at)', date('Y'))
            ->countAllResults();
        $data['recentOrders'] = $this->orderModel
            ->select("orders.id, orders.tracking_code, customers.fullname as customer_name, customers.customer_code as customer_code, orders.created_at,
        CASE
            WHEN orders.invoice_id IS NULL THEN 'in_stock'  -- Đơn tồn kho (chưa có invoice)
            WHEN i.shipping_status = 'pending' THEN 'shipping'  -- Đơn đang giao
            WHEN i.shipping_status = 'confirmed' THEN 'shipped'  -- Đơn đã giao
            ELSE 'unknown'  -- Trường hợp khác
        END AS order_status")
            ->join('customers', 'customers.id = orders.customer_id', 'left')
            ->join('invoices i', 'i.id = orders.invoice_id', 'left') // Kết hợp với bảng invoices
            ->orderBy('orders.created_at', 'DESC')
            ->limit(8)
            ->findAll();

SELECT DATE(created_at) as order_date, COALESCE(SUM(total_weight), 0) as total_weight
FROM `orders`
WHERE `created_at` >= '2025-02-11'
GROUP BY `order_date`
ORDER BY `order_date` ASC
---


        // Lấy tổng cân nặng mỗi ngày trong 30 ngày gần nhất từ bảng orders
        $weightData = $this->orderModel
            ->select("DATE(created_at) as order_date, COALESCE(SUM(total_weight), 0) as total_weight")
            ->where('created_at >=', date('Y-m-d', strtotime('-30 days')))
            ->groupBy('order_date')
            ->orderBy('order_date', 'ASC')
            ->findAll();

SELECT DATE(created_at) as invoice_date, COALESCE(SUM(shipping_fee), 0) as total_shipping_fee
FROM `invoices`
WHERE `created_at` >= '2025-02-11'
GROUP BY `invoice_date`
ORDER BY `invoice_date` ASC
---


        // Lấy phí giao hàng mỗi ngày trong 30 ngày gần nhất từ bảng invoices
        $shippingFeeData = $this->invoiceModel
            ->select("DATE(created_at) as invoice_date, COALESCE(SUM(shipping_fee), 0) as total_shipping_fee")
            ->where('created_at >=', date('Y-m-d', strtotime('-30 days')))
            ->groupBy('invoice_date')
            ->orderBy('invoice_date', 'ASC')
            ->findAll();