app/Controllers/InvoiceController.php

SELECT `orders`.`id` as `order_id`, `orders`.`tracking_code`, `orders`.`order_code`, `customers`.`id` as `customer_id`, `customers`.`customer_code`, `customers`.`fullname` as `customer_name`, `orders`.`quantity`, `orders`.`total_weight`, `orders`.`length`, `orders`.`width`, `orders`.`height`, `orders`.`volume`, `orders`.`price_per_kg`, `orders`.`price_per_cubic_meter`, `orders`.`domestic_fee`, `orders`.`exchange_rate`, `orders`.`export_date`, `orders`.`created_at`, `orders`.`vietnam_stock_date`
FROM `orders`
JOIN `customers` ON `orders`.`customer_id` = `customers`.`id`
WHERE `orders`.`id` IN ('14389')
---
    public function cart()
    {
        $cart = session()->get('cart') ?? [];

        if (!is_array($cart) || empty($cart)) {
            return view('invoices/cart', ['customerCart' => []]);
        }

        // Lấy thông tin chi tiết của các orders từ DB
        $orderModel = new \App\Models\OrderModel();
        $orders = $orderModel
            ->select('
            orders.id as order_id,
            orders.tracking_code,
            orders.order_code,
            customers.id as customer_id,
            customers.customer_code,
            customers.fullname as customer_name,
            orders.quantity,
            orders.total_weight,
            orders.length,
            orders.width,
            orders.height,
            orders.volume,
            orders.price_per_kg,
            orders.price_per_cubic_meter,
            orders.domestic_fee,
            orders.exchange_rate,
            orders.export_date,
            orders.created_at,
            orders.vietnam_stock_date
        ')
            ->join('customers', 'orders.customer_id = customers.id')
            ->whereIn('orders.id', $cart)
            ->findAll();

SELECT *
FROM `orders`
WHERE `orders`.`id` = '14389'
SELECT `orders`.`id` as `order_id`, `orders`.`tracking_code`, `orders`.`order_code`, `customers`.`id` as `customer_id`, `customers`.`customer_code`, `customers`.`fullname` as `customer_name`, `orders`.`quantity`, `orders`.`total_weight`, `orders`.`length`, `orders`.`width`, `orders`.`height`, `orders`.`volume`, `orders`.`price_per_kg`, `orders`.`price_per_cubic_meter`, `orders`.`domestic_fee`, `orders`.`exchange_rate`, `orders`.`export_date`, `orders`.`created_at`, `orders`.`vietnam_stock_date`
FROM `orders`
LEFT JOIN `customers` ON `orders`.`customer_id` = `customers`.`id`
WHERE `orders`.`id` IN ('14389')
---
    public function create($customerId)
    {
        // Lấy danh sách các order từ session
        $cart = session()->get('cart') ?? [];

        // Lọc các order thuộc về customer_id hiện tại
        $orderIds = array_filter($cart, function ($orderId) use ($customerId) {
            $order = (new \App\Models\OrderModel())->find($orderId);
            return $order && $order['customer_id'] == $customerId;
        });

        if (empty($orderIds)) {
            return redirect()->to('/invoices/cart')->with('error', 'Không có đơn hàng nào trong giỏ cho khách hàng này.');
        }

        // Lấy thông tin chi tiết của các orders từ DB
        $orderModel = new \App\Models\OrderModel();
        $orders = $orderModel
            ->select('
            orders.id as order_id,
            orders.tracking_code,
            orders.order_code,
            customers.id as customer_id,
            customers.customer_code,
            customers.fullname as customer_name,
            orders.quantity,
            orders.total_weight,
            orders.length,
            orders.width,
            orders.height,
            orders.volume,
            orders.price_per_kg,
            orders.price_per_cubic_meter,
            orders.domestic_fee,
            orders.exchange_rate,
            orders.export_date,
            orders.created_at,
            orders.vietnam_stock_date
        ')
            ->join('customers', 'orders.customer_id = customers.id', 'left')
            ->whereIn('orders.id', $orderIds)
            ->findAll();

SELECT *
FROM `customers`
WHERE `customers`.`id` = '11'
---
        }

        // Lấy thông tin khách hàng từ bảng customers
        $customer = (new \App\Models\CustomerModel())->find($customerId);

SELECT *
FROM `orders`
WHERE `id` IN ('14389')
---
    public function store($customerId)
    {
        $orderIds = explode(',', $this->request->getPost('order_ids'));
        $shippingFee = $this->request->getPost('shipping_fee');
        $otherFee = $this->request->getPost('other_fee');
        $notes = $this->request->getPost('notes'); // Lấy ghi chú từ form

        // Lấy giỏ hàng từ session
        $cart = session()->get('cart') ?? [];

        // Kiểm tra nếu giỏ hàng rỗng hoặc không có đơn hàng nào
        if (empty($cart)) {
            return redirect()->back()->with('modal_error', 'Giỏ hàng trống. Vui lòng thêm đơn hàng trước khi tạo phiếu xuất.');
        }

        // Kiểm tra nếu orderIds rỗng hoặc không khớp với cart
        if (empty($orderIds) || count($orderIds) === 0) {
            return redirect()->back()->with('modal_error', 'Không có đơn hàng nào để tạo phiếu xuất.');
        }

        // Lọc các orderIds có trong cart
        $validOrderIds = array_intersect($orderIds, $cart);
        if (empty($validOrderIds)) {
            return redirect()->back()->with('modal_error', 'Không có đơn hàng hợp lệ trong giỏ hàng để tạo phiếu xuất.');
        }

        // Kiểm tra xem các đơn hàng đã thuộc phiếu xuất nào chưa
        $orderModel = new \App\Models\OrderModel();
        $invoiceModel = new \App\Models\InvoiceModel();
        $orders = $orderModel->whereIn('id', $validOrderIds)->findAll();

INSERT INTO `invoices` (`customer_id`, `created_by`, `shipping_fee`, `other_fee`, `shipping_status`) VALUES ('11', '26', '0', '0', 'pending')
---
            'notes' => $notes // Thêm ghi chú vào dữ liệu invoice
        ];
        $invoiceModel = new \App\Models\InvoiceModel();
        $invoiceId = $invoiceModel->insert($invoiceData);

SELECT *
FROM `invoices`
WHERE `invoices`.`id` = '484'
SELECT *
FROM `customers`
WHERE `customers`.`id` = '11'
SELECT `orders`.*, `product_types`.`name` as `product_type_name`
FROM `orders`
LEFT JOIN `product_types` ON `orders`.`product_type_id` = `product_types`.`id`
WHERE `orders`.`invoice_id` = '484'
SELECT `id`, `customer_code`, `fullname`
FROM `customers`
ORDER BY `customer_code` ASC
SELECT *
FROM `users`
WHERE `users`.`id` = '26'
---
    public function detail($invoiceId)
    {
        $invoiceModel = new \App\Models\InvoiceModel();
        $orderModel = new \App\Models\OrderModel();
        $customerModel = new \App\Models\CustomerModel();
        $userModel = new \App\Models\UserModel();
        $paymentModel = new \App\Models\InvoicePaymentModel();

        $invoice = $invoiceModel->find($invoiceId);
        if (!$invoice) {
            return redirect()->to('/invoices')->with('error', 'Phiếu xuất không tồn tại.');
        }

        $customer = $customerModel->find($invoice['customer_id']);
        if (!$customer) {
            return redirect()->to('/invoices')->with('error', 'Khách hàng không tồn tại.');
        }

        $orders = $orderModel
            ->select('orders.*, product_types.name as product_type_name')
            ->join('product_types', 'orders.product_type_id = product_types.id', 'left')
            ->where('orders.invoice_id', $invoiceId)
            ->findAll();

        // Lấy danh sách khách hàng để hiển thị trong modal chuyển khách hàng
        $customers = $customerModel->select('id, customer_code, fullname')->orderBy('customer_code', 'ASC')->findAll();

        $creator = $userModel->find($invoice['created_by']);

SELECT *
FROM `invoices`
WHERE `invoices`.`id` = '484'
UPDATE `invoices` SET `shipping_status` = 'confirmed', `shipping_confirmed_by` = '26', `shipping_confirmed_at` = '2025-03-13 11:13:59'
WHERE `invoices`.`id` IN ('484')
---
    public function confirmShipping($invoiceId)
    {
        if (!in_array(session('role'), ['Nhân viên', 'Quản lý'])) {
            return redirect()->back()->with('error', 'Bạn không có quyền xác nhận giao hàng.');
        }

        $invoiceModel = new \App\Models\InvoiceModel();
        $orderModel = new \App\Models\OrderModel();

        // Lấy thông tin hóa đơn
        $invoice = $invoiceModel->find($invoiceId);
        if (!$invoice) {
            return redirect()->back()->with('error', 'Phiếu xuất không tồn tại.');
        }

        // Kiểm tra nếu shipping_status đã là 'confirmed'
        if ($invoice['shipping_status'] === 'confirmed') {
            return redirect()->to("/invoices/detail/{$invoiceId}")->with('info', 'Phiếu xuất đã được xác nhận giao hàng trước đó.');
        }

        // Chuẩn bị dữ liệu cập nhật
        $updateData = [
            'shipping_status' => 'confirmed',
            'shipping_confirmed_by' => session()->get('user_id'), // Gán ID người xác nhận
            'shipping_confirmed_at' => date('Y-m-d H:i:s') // Gán thời gian xác nhận
        ];

        // Thực hiện cập nhật hóa đơn
        if ($invoiceModel->update($invoiceId, $updateData)) {