app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
SELECT `roles`.`role_name`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '1'
 LIMIT 1
---
    public function authenticate()
    {

        $session = session();
        $model = new UserModel();
        $roleModel = new UserRoleModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();

        if ($user && password_verify($password, $user['password'])) {

            $role = $roleModel->select('roles.role_name')
                          ->join('roles', 'roles.id = user_roles.role_id')
                          ->where('user_roles.user_id', $user['id'])
                          ->first();