app/Controllers/OrderController.php


        // Lấy dữ liệu phân trang
        $data['orders'] = $query->paginate($perPage);
        $data['pager'] = $this->orderModel->pager;

        // Lấy danh sách khách hàng để hiển thị dropdown
        $customerModel = new \App\Models\CustomerModel();
        $data['customers'] = $customerModel->select('customer_code, fullname')->orderBy('customer_code', 'ASC')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
LEFT JOIN `product_types` ON `product_types`.`id` = `orders`.`product_type_id`
LEFT JOIN `invoices` ON `invoices`.`id` = `orders`.`invoice_id`
SELECT `orders`.*, `customers`.`fullname` AS `customer_name`, `customers`.`customer_code` AS `customer_code`, `product_types`.`name` AS `product_type_name`, `invoices`.`shipping_status` AS `invoice_shipping_status`, `invoices`.`id` AS `invoice_id`
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
LEFT JOIN `product_types` ON `product_types`.`id` = `orders`.`product_type_id`
LEFT JOIN `invoices` ON `invoices`.`id` = `orders`.`invoice_id`
ORDER BY `orders`.`id` DESC
 LIMIT 30
SELECT `orders`.*, `customers`.`fullname` AS `customer_name`, `customers`.`customer_code` AS `customer_code`, `product_types`.`name` AS `product_type_name`, `invoices`.`shipping_status` AS `invoice_shipping_status`, `invoices`.`id` AS `invoice_id`
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
LEFT JOIN `product_types` ON `product_types`.`id` = `orders`.`product_type_id`
LEFT JOIN `invoices` ON `invoices`.`id` = `orders`.`invoice_id`
WHERE `customers`.`customer_code` = 'PHANTHONG'
ORDER BY `orders`.`id` DESC
 LIMIT 30
SELECT `customer_code`, `fullname`
FROM `customers`
ORDER BY `customer_code` ASC