app/Controllers/TrackingController.php

SELECT *
FROM `orders`
WHERE `tracking_code` LIKE '300600280941%' ESCAPE '!'
 LIMIT 1
---
    public function check()
    {
        $trackingCode = $this->request->getGet('tracking_code');

        if (!$trackingCode) {
            return view('tracking', ['error' => 'Vui lòng nhập mã vận đơn']);
        }

        $orderModel = new OrderModel();
        $invoiceModel = new InvoiceModel();

        // Lấy thông tin đơn hàng theo mã tracking_code
        $order = $orderModel->like('tracking_code', $trackingCode, 'after')->first();

SELECT *
FROM `invoices`
WHERE `id` IS NULL
 LIMIT 1
---
        }

        // 3. Đã tạo phiếu xuất (Có trong `invoices`)
        $invoice = $invoiceModel->where('id', $order['invoice_id'])->first();