app/Models/CustomerModel.php

    public function getTopCustomers()
    {
        return $this->select('
                customers.customer_code,
                customers.phone,
                customers.zalo_link,
                customers.email,
                COUNT(orders.id) as total_orders
            ')
            ->join('orders', 'orders.customer_id = customers.id', 'left')
            ->groupBy('customers.id')
            ->orderBy('total_orders', 'DESC')
            ->limit(10)
            ->findAll();
---
SELECT `customers`.`customer_code`, `customers`.`phone`, `customers`.`zalo_link`, `customers`.`email`, COUNT(orders.id) as total_orders
FROM `customers`
LEFT JOIN `orders` ON `orders`.`customer_id` = `customers`.`id`
GROUP BY `customers`.`id`
ORDER BY `total_orders` DESC
 LIMIT 10