app/Models/InvoicePaymentModel.php

SELECT SUM(`amount`) AS `total_paid`
FROM `invoice_payments`
WHERE `invoice_id` = '484'
 LIMIT 1
---
    public function getTotalPaidByInvoice($invoiceId)
    {
        return $this->selectSum('amount', 'total_paid')
            ->where('invoice_id', $invoiceId)
            ->first()['total_paid'] ?? 0.00; // Đảm bảo trả về float với giá trị mặc định 0.00