app/Models/OrderModel.php

    public function getOrdersInLast30Days()
    {
        return $this->select("DATE(created_at) as order_date, COUNT(id) as total_orders")
            ->where('created_at >=', date('Y-m-d', strtotime('-30 days')))
            ->groupBy('order_date')
            ->orderBy('order_date', 'ASC')
            ->findAll();
---
SELECT DATE(created_at) as order_date, COUNT(id) as total_orders
FROM `orders`
WHERE `created_at` >= '2025-02-11'
GROUP BY `order_date`
ORDER BY `order_date` ASC