app/Models/ProductTypeModel.php

SELECT `product_types`.`name`, COUNT(orders.id) as total_orders
FROM `product_types`
INNER JOIN `orders` ON `orders`.`product_type_id` = `product_types`.`id`
GROUP BY `product_types`.`id`
ORDER BY `total_orders` DESC
---
    public function getProductTypeStatistics()
    {
        return $this->select('product_types.name, COUNT(orders.id) as total_orders')
            ->join('orders', 'orders.product_type_id = product_types.id', 'inner')
            ->groupBy('product_types.id')
            ->orderBy('total_orders', 'DESC')
            ->findAll();